poly_015/template_flowfield/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            zeroGradient;
    }

    back
    {
        type            zeroGradient;
    }
    
    top
    {
        type            symmetry;
    }

    bottom
    {
        type            symmetry;
    }

    right
    {
        type            symmetry;
    }

    left
    {
        type            symmetry;
    }
      
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
