poly_015/template_flowfield/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    U
    //"(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
}

 SIMPLE
 {
     nNonOrthogonalCorrectors     0;
     consistent     	        yes;
     pRefPoint    (0.000141421 0 0);
     //pRefCell		              0;
     pRefValue                    0;
     
     residualControl
     {
         p               1e-6;
         U               1e-6;
         //"(k|epsilon|omega|f|v2)" 1e-3;
     }
 }


relaxationFactors
{
    equations
    {
        U               0.7; // 0.9 is more stable but 0.95 more convergent
        ".*"            0.7; // 0.9 is more stable but 0.95 more convergent
    }
}


// ************************************************************************* //
