poly_015/template_flowfield/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        action  new;
        name    firstHalf;
        type    cellSet;

        source  boxToCell;
        sourceInfo
        {
            box (-7.27e-5 -0.0001028 -0.0001028) (0 0.0001028 0.0001028);	//we need to capture a cell center
        }
    }

    {
        action  new;
        name    firstHalfZone;
        type    cellZoneSet;

        source  setToCellZone;
        sourceInfo
        {
            set firstHalf;
        }
    }
{
        action  new;
        name    lastHalf;
        type    cellSet;

        source  boxToCell;
        sourceInfo
        {
            box (0 -0.0001028 -0.0001028) (7.27e-05 0.0001028 0.0001028);    //we need to capture a cell center
        }
    }

    {
        action  new;
        name    lastHalfZone;
        type    cellZoneSet;

        source  setToCellZone;
        sourceInfo
        {
            set lastHalf;
        }
    }


);

// ************************************************************************* //
